Исходник/src/Catalogs/ТранспортныеСредства/ТранспортныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТранспортныеСредства</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Транспортные_средства_по_лизингу</name>
      <description>Транспортные средства по лизингу</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип_тс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем_двигателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мощность_двигателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата_выпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>График_прохождения_отс</name>
    <attributes>
      <name>Дата_прохождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Исходник/src/InformationRegisters/ИсторияТС/ИсторияТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияТС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортныеСредства</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Исходник/src/Catalogs/ТранспортныеСредства/Forms/ФормаЭлемента1/Module.bsl
Перем МодификацияРеквизита;

&НаСервере
Процедура ПриОткрытииНаСервере()
	МодификацияРеквизита = Ложь;
	// Не использовать для новых объектов
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	// Запрос к виртуальной таблице СрезПоследних
	// регистра сведений ИсторияЗначений
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсторияЗначенийСрезПоследних.Значение КАК Водитель
		|ИЗ
		|	РегистрСведений.ИсторияТС.СрезПоследних(&Дата, ТранспортныеСредства = &ТранспортныеСредства) КАК ИсторияЗначенийСрезПоследних";
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТранспортныеСредства", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	// Получение последнего значения
	Если Результат.Следующий() Тогда
		Водитель = Результат.Водитель;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если МодификацияРеквизита = Ложь Тогда
		Возврат;  
	КонецЕсли;
		Рег = РегистрыСведений.ИсторияТС.СоздатьМенеджерЗаписи();
		Рег.Период = ТекущаяДата();
		Рег.ТранспортныеСредства = Объект.Ссылка;
		Рег.Значение = Водитель;
		Рег.Записать();
КонецПроцедуры

&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	МодификацияРеквизита = Истина;
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ВодительПриИзмененииНаСервере();
КонецПроцедуры
